node {
  name: "X"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 10004
        }
      }
    }
  }
}
node {
  name: "y_seq"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 5002
        }
      }
    }
  }
}
node {
  name: "y_corr"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 5002
        }
      }
    }
  }
}
node {
  name: "keep_prob/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "keep_prob"
  op: "PlaceholderWithDefault"
  input: "keep_prob/input"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Abs"
  op: "Abs"
  input: "X"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Max/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Max"
  op: "Max"
  input: "Abs"
  input: "Max/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Sign"
  op: "Sign"
  input: "Max"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Sum"
  op: "Sum"
  input: "Sign"
  input: "Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Cast"
  op: "Cast"
  input: "Sum"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_layer_0/DropoutWrapperInit/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hidden_layer_0/DropoutWrapperInit/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/range"
  op: "Range"
  input: "hidden_layer_0/rnn/range/start"
  input: "hidden_layer_0/rnn/Rank"
  input: "hidden_layer_0/rnn/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/concat/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/concat"
  op: "ConcatV2"
  input: "hidden_layer_0/rnn/concat/values_0"
  input: "hidden_layer_0/rnn/range"
  input: "hidden_layer_0/rnn/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/transpose"
  op: "Transpose"
  input: "X"
  input: "hidden_layer_0/rnn/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/sequence_length"
  op: "Identity"
  input: "Cast"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Shape"
  op: "Shape"
  input: "hidden_layer_0/rnn/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice"
  op: "StridedSlice"
  input: "hidden_layer_0/rnn/Shape"
  input: "hidden_layer_0/rnn/strided_slice/stack"
  input: "hidden_layer_0/rnn/strided_slice/stack_1"
  input: "hidden_layer_0/rnn/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros/packed/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 102
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros/packed"
  op: "Pack"
  input: "hidden_layer_0/rnn/strided_slice"
  input: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros/packed/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros"
  op: "Fill"
  input: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros/packed"
  input: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1/packed/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 102
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1/packed"
  op: "Pack"
  input: "hidden_layer_0/rnn/strided_slice"
  input: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1/packed/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1"
  op: "Fill"
  input: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1/packed"
  input: "hidden_layer_0/rnn/DropoutWrapperZeroState/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Shape_1"
  op: "Shape"
  input: "hidden_layer_0/rnn/sequence_length"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/stack"
  op: "Pack"
  input: "hidden_layer_0/rnn/strided_slice"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Equal"
  op: "Equal"
  input: "hidden_layer_0/rnn/Shape_1"
  input: "hidden_layer_0/rnn/stack"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "incompatible_shape_error"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/All"
  op: "All"
  input: "hidden_layer_0/rnn/Equal"
  input: "hidden_layer_0/rnn/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Expected shape for Tensor hidden_layer_0/rnn/sequence_length:0 is "
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Assert/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: " but saw shape: "
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Expected shape for Tensor hidden_layer_0/rnn/sequence_length:0 is "
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Assert/Assert/data_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: " but saw shape: "
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Assert/Assert"
  op: "Assert"
  input: "hidden_layer_0/rnn/All"
  input: "hidden_layer_0/rnn/Assert/Assert/data_0"
  input: "hidden_layer_0/rnn/stack"
  input: "hidden_layer_0/rnn/Assert/Assert/data_2"
  input: "hidden_layer_0/rnn/Shape_1"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_INT32
        type: DT_STRING
        type: DT_INT32
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "hidden_layer_0/rnn/CheckSeqLen"
  op: "Identity"
  input: "hidden_layer_0/rnn/sequence_length"
  input: "^hidden_layer_0/rnn/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Shape_2"
  op: "Shape"
  input: "hidden_layer_0/rnn/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_1"
  op: "StridedSlice"
  input: "hidden_layer_0/rnn/Shape_2"
  input: "hidden_layer_0/rnn/strided_slice_1/stack"
  input: "hidden_layer_0/rnn/strided_slice_1/stack_1"
  input: "hidden_layer_0/rnn/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Shape_3"
  op: "Shape"
  input: "hidden_layer_0/rnn/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/strided_slice_2"
  op: "StridedSlice"
  input: "hidden_layer_0/rnn/Shape_3"
  input: "hidden_layer_0/rnn/strided_slice_2/stack"
  input: "hidden_layer_0/rnn/strided_slice_2/stack_1"
  input: "hidden_layer_0/rnn/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "hidden_layer_0/rnn/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/ExpandDims"
  op: "ExpandDims"
  input: "hidden_layer_0/rnn/strided_slice_2"
  input: "hidden_layer_0/rnn/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 102
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/concat_1"
  op: "ConcatV2"
  input: "hidden_layer_0/rnn/ExpandDims"
  input: "hidden_layer_0/rnn/Const_1"
  input: "hidden_layer_0/rnn/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/zeros"
  op: "Fill"
  input: "hidden_layer_0/rnn/concat_1"
  input: "hidden_layer_0/rnn/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Min"
  op: "Min"
  input: "hidden_layer_0/rnn/CheckSeqLen"
  input: "hidden_layer_0/rnn/Const_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Max"
  op: "Max"
  input: "hidden_layer_0/rnn/CheckSeqLen"
  input: "hidden_layer_0/rnn/Const_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_layer_0/rnn/time"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/TensorArrayV2/element_shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377f\000\000\000"
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/TensorArrayV2"
  op: "TensorListReserve"
  input: "hidden_layer_0/rnn/TensorArrayV2/element_shape"
  input: "hidden_layer_0/rnn/strided_slice_1"
  attr {
    key: "element_dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape_type"
    value {
      type: DT_INT32
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_ARRAY
      args {
        type_id: TFT_TENSOR
        args {
          type_id: TFT_FLOAT
        }
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/TensorArrayV2_1/element_shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\024\'\000\000"
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/TensorArrayV2_1"
  op: "TensorListReserve"
  input: "hidden_layer_0/rnn/TensorArrayV2_1/element_shape"
  input: "hidden_layer_0/rnn/strided_slice_1"
  attr {
    key: "element_dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape_type"
    value {
      type: DT_INT32
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_ARRAY
      args {
        type_id: TFT_TENSOR
        args {
          type_id: TFT_FLOAT
        }
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\024\'\000\000"
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/TensorArrayUnstack/TensorListFromTensor"
  op: "TensorListFromTensor"
  input: "hidden_layer_0/rnn/transpose"
  input: "hidden_layer_0/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape"
  attr {
    key: "element_dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape_type"
    value {
      type: DT_INT32
    }
  }
  experimental_type {
    type_id: TFT_PRODUCT
    args {
      type_id: TFT_ARRAY
      args {
        type_id: TFT_TENSOR
        args {
          type_id: TFT_FLOAT
        }
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Maximum/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Maximum"
  op: "Maximum"
  input: "hidden_layer_0/rnn/Maximum/x"
  input: "hidden_layer_0/rnn/Max"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/Minimum"
  op: "Minimum"
  input: "hidden_layer_0/rnn/strided_slice_1"
  input: "hidden_layer_0/rnn/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "hidden_layer_0/rnn/while/loop_counter"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "z\'\000\000\230\001\000\000"
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.02388865128159523
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.02388865128159523
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomGetKeyCounter/seed"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: ";\215\367(\000\000\000\000"
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomGetKeyCounter"
  op: "StatelessRandomGetKeyCounter"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomGetKeyCounter/seed"
  attr {
    key: "Tseed"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomUniformV2/alg"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomUniformV2"
  op: "StatelessRandomUniformV2"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/shape"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomGetKeyCounter"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomGetKeyCounter:1"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomUniformV2/alg"
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/sub"
  op: "Sub"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/max"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/mul"
  op: "Mul"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/StatelessRandomUniformV2"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform"
  op: "AddV2"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/mul"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10106
        }
        dim {
          size: 408
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/dense/kernel"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Initializer/stateless_random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/dense/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 408
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/dense/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 408
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/dense/bias"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/dense/bias"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/bias/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/dense/bias"
  input: "rnn/layer_norm_basic_lstm_cell/dense/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/dense/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/dense/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_1/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_2/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 102
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma/Assign"
  op: "AssignVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_3/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 102
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "rnn/layer_norm_basic_lstm_cell/layer_normalization_3/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@rnn/layer_norm_basic_lstm_cell/layer_normalization_3/beta"
      }
    }
  }
  attr {
